Table of Contents
 Class ImmutableIdentifier<T>
Namespace
IdeaStatiCa.BimApiLink.Identifiers
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class ImmutableIdentifier<T> : Identifier<T>, IIdentifier, IIdeaPersistenceToken, IEquatable<IIdentifier> where T : IIdeaObject
Type Parameters
T
Inheritance
object
Identifier<T>
ImmutableIdentifier<T>
Implements
IIdentifier
IIdeaPersistenceToken
IEquatable<IIdentifier>
Derived
ConnectedMemberIdentifier<T>
ConnectionIdentifier<T>
IntIdentifier<T>
StringIdentifier<T>
Inherited Members
 Identifier<T>.ObjectType
 Identifier<T>.Equals(IIdentifier)
 Identifier<T>.Equals(object)
 Identifier<T>.GetHashCode()
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 ImmutableIdentifier(string)
protected ImmutableIdentifier(string stringId)
Parameters
stringId string
Methods
 GetId()
public override object GetId()
Returns
object
 GetStringId()
public override string GetStringId()
Returns
string
 Edit this page